%**************************************************************************
% 代码说明：相关系数求解
% 输入：X:输入数据，每一行为一个样本。
%       flag: 0 :按行求解 1：按列求解
%       求解每一列之间的相关系数，每一列为
%
% 输出：yanmo_new:选取的新掩膜，包含几个覆盖区域
%**************************************************************************
function coe = fun_coe(X,flag) 
    if flag == 0
        X = X';
    end
    if size(X,2)==2
        co_mat = corr(X,'type','Pearson');
        coe = co_mat(1,2);
    else
        coe = corr(X,'type','Pearson');     
    end
end

